# Type Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationDimensionDefinition..::..Type Property
FabricationDimensionDefinition Class See Also
---
Fabrication dimension type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public FabricationDimensionType Type { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Type As FabricationDimensionType
	Get
```

Visual C++
---
```text
public:
property FabricationDimensionType Type {
	FabricationDimensionType get ();
}
```

# See Also
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace